{
  "about": [
    {
      "img": "./public/flakit_master_avatar4.png",
      "text": [
        "I am a Software Engineer with a passion for solving problems about human behavior and its relationship with the natural and urban environments from infrastructure to climate and points between.",
        "I have a core belief that truth and honesty with ourselves and each other is the best way to create an environment filled with meaningful and productive relationships.",
        "My previous career pursuits have led me through a healthy number of varied experiences which have in turn given me a well-rounded set of skills.",
        "Apart from my academic pursuits in classical composition and performance, I have worked as a technical support agent, piano technician, theater technician, and farmer. "
      ],
      "tech": [
        {
          "text": "Here are some of the technologies I've been working in:",
          "techs": [
            "React.js", "JavaScript", "Python", "Ruby on Rails", "CSS", "React Redux", "SQL", "Flask"
          ]
        }
      ]
    }

  ],
  "experience": [
    {
      "menu": {
        "flatiron": {
          "place": "Flatiron School",
          "text": [
            "As a student, studied front and back-end development in JavaScript, React, Ruby on Rails, and Python / Flask.", 
            "Designed, wireframed, and developed several applications both individually and as part of a team using combinations of the aforementioned languages and existing or custom APIs.",
            "Assisted other students with their studies and projects helping to ensure the class as a whole was able to achieve the most out of the time on and off campus.", 
            "This included leading study and review sessions outside of normal class hours.",
            "Independantly learned additional tools such as React Redux and more advanced CSS concepts.",
            "Demonstrated and presented applications in front of audiences of students and teachers giving user scenarios and explinations of code as well as expereinces thereof."
          ]
        },
        "piano": {
          "place":"Piano Technician",
          "text": [
            "Provided piano tuning, regulation and repair services to an average of 10 clients a week using electronic and ear techniques with standard piano tuning and repair tools in order to bring their instrument to its designed specs, allowing it to sound its best, and resolve or prevent performance issues in client pianos.",
            "Maintained a database of clients as well as payment and invoicing tooling using Google Sheets, Xero invoicing, and Square payments in order keep track of client service records, payments, and future service needs."
          ]
        },
        "masters": {
          "place": "CUNY Broooklyn College",
          "text": [
            "Earned a Master's in Music (MM) degree in Composition with a focus on orchestral and experimental playback. Performed original and existing music in small ensembles for live audiences.",
            "Presented research projects on historical subjects and created reports on analytical topics in traditional western music theory as well as Shenkerian analysis.",
            "Designed and built a handful of electronic music instruments using resistor-capacitor circuits, Arduino, and integrated circuits.",
            "As a final thesis, composed a 27 minute, multi-movement symphony for 60-piece orchestra."
          ]
        },
        "roli": {
          "place": "ROLI",
          "text": [
            "Designed and implemented a system to track and catalog product shipments and returns using Google Sheets and Google Docs significantly reducing the turnover period of returns from 5 weeks to 2 weeks and reducing lost shipments from 4% to 1%.",
            "Coordinated between Tech Support, Sales, Logistics, and Package Carriers in order to provide a smooth transaction for customers by providing accurate updates using the aforementioned cataloging system and reducing interdepartmental lead times from 5 to 2 business days.",
            "Created documentation and project description outlining the returns process and how it should continue to expand in order to provide a guideline for a future RMA system and returns department.",
            "Initiated and performed repairs of MIDI instruments in New York reducing the turnaround for faulty products within the US and Canada from 8 weeks to 2 weeks."
          ]
        }
      }
    
    }
  ],
  "projects": [
    {
      "id": 1,
      "title": "TadLab",
      "category": "music",
      "img": "../../public/tadlab_demo.gif",
      "description": "An in-browser software synthesizer controlled with the mouse and keyboard that is capable of producing polyphonic sounds, and effects.",
      "tools": ["React.js", "Tone.js", "Ruby on Rails", "CSS"],
      "links":
        {
        "github": "https://github.com/tdep/tadlab",
        "tonejs": "https://tonejs.github.io/"
        }
    },
    {
      "id": 2,
      "title": "Sequinzer 6001-2a",
      "category": "music",
      "img": "../../public/sequinzer_demo.gif",
      "description": "",
      "tools": [
        "React.js",
        "WebAudio API",
        "Ruby",
        "Rails",
        "CSS"
      ],
      "links": [
        {
          "github": "https://github.com/tdep/Sequinzer-6001-2a",
          "webaudio": "https://developer.mozilla.org/en-US/docs/Web/API/Web_Audio_API"
        }
      ]
    }
  ],
  "contact": [

  ],
  "blogs": [

  ]
}